/********************************************************************************** 
* 阶乘的精确值
*
* 输入不超过1000的正整数n，输出n！=1*2*3*4*...*n的精确结果
*
* 样例输入:30
* 样例输出:265252859812191058636308480000000
*               
**********************************************************************************/


#include <stdio.h>
#include <string.h>
const int MAX = 3000;
int a[MAX];
int main()
{
	int i,j,n;
	scanf("%d", &n);
	memset(a,0,sizeof(a));
	a[0] = 1;
	for(i=2;i<n+1;i++)
	{
		//乘以i
		int c = 0;
		for(j=0;j<MAX;j++)
		{
			int s = a[j]*i + c;
			a[j] = s%10;
			c=s/10;
		}
	}
	for(j=MAX-1;j>=0;j--)
	{
		if(a[j])
		{
			break;//忽略前导0
		}
	}
	for(i=j;i>=0;i--)
	{
		printf("%d",a[i]);
	}
	return 0;
}
